//===================================================================
//
//	雲の生成情報[enemy_data.h]
//	Author : SHUGO KURODA
//
//===================================================================
#ifndef _CLOUD_DATA_H_
#define _CLOUD_DATA_H_

//*******************************************************************
//	敵のロード情報の定義
//*******************************************************************
typedef struct
{
	// 雲が生成されるまでの時間(乱数)
	int nRandTime;
	// 雲が生成されるまでの時間カウンター
	int nCount;
}CloudInfo;

#endif		// _CLOUD_DATA_H_
