//-----------------------------------------------------------------------------------------------
//
// 爆発の処理[explosion.cpp]
// Author : SHUGO KURODA
//
//-----------------------------------------------------------------------------------------------

//-----------------------------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------------------------
#include "explosion.h"		// プレイヤー
#include "manager.h"		// アプリケーション
#include "renderer.h"		// レンダリング
#include "sound.h"

//-----------------------------------------------------------------------------------------------
// 定数宣言
//-----------------------------------------------------------------------------------------------
// アニメーション間隔
const int CExplosion::ANIM_INTERVAL = 5;
// アニメーション最大数
const int CExplosion::MAX_ANIM = 8;
// U座標(X方向)の最大分割数
const int CExplosion::DIVISION_U = 4;
// V座標(Y方向)の最大分割数
const int CExplosion::DIVISION_V = 2;

//-----------------------------------------------------------------------------------------------
// 静的メンバ変数
//-----------------------------------------------------------------------------------------------
// テクスチャのポインタ
LPDIRECT3DTEXTURE9 CExplosion::m_pTexture = nullptr;

//-----------------------------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------------------------
CExplosion::CExplosion()
	:m_nCntAnim(0), m_nPatternAnim(0), m_nPatterAnimV(0)
{
	// オブジェクトタイプの設定
	SetObjType(EObject::OBJ_EXPLOSION);
}

//-----------------------------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------------------------
CExplosion::~CExplosion()
{
}

//-----------------------------------------------------------------------------------------------
// 生成
// const D3DXVECTOR3& pos → 生成する位置
//-----------------------------------------------------------------------------------------------
CExplosion* CExplosion::Create(const D3DXVECTOR3& pos, const D3DXVECTOR2& size)
{
	// ポインタクラスを宣言
	CExplosion* pExplosion = new CExplosion;

	if (pExplosion != nullptr)
	{// もしnullptrではなかったら

		// 位置設定
		pExplosion->SetPosition(pos);

		// サイズ設定
		pExplosion->SetSize(size);

		// 初期化
		pExplosion->Init();

		// テクスチャの設定
		pExplosion->BindTexture(m_pTexture);
	}

	return pExplosion;
}

//-----------------------------------------------------------------------------------------------
// テクスチャの読み込み
//-----------------------------------------------------------------------------------------------
HRESULT CExplosion::Load()
{
	// デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = CManager::GetRenderer()->GetDevice();

	// テクスチャの読み込み
	D3DXCreateTextureFromFile(pDevice,
		"data/TEXTURE/explosion000.png",
		&m_pTexture);

	return S_OK;
}

//-----------------------------------------------------------------------------------------------
// テクスチャの削除
//-----------------------------------------------------------------------------------------------
void CExplosion::Unload()
{
	// テクスチャの破棄
	if (m_pTexture != nullptr)
	{
		m_pTexture->Release();
		m_pTexture = nullptr;
	}
}

//-----------------------------------------------------------------------------------------------
// 初期化
//-----------------------------------------------------------------------------------------------
HRESULT CExplosion::Init()
{
	//初期化
	CObject2D::Init();

	// テクスチャ更新
	CObject2D::SetAnimation(m_nPatternAnim, 2, DIVISION_U, DIVISION_V);

	// 爆発音
	CSound::Play(CSound::SOUND_LABEL_SE_EXPLOSION);

	return S_OK;
}

//-----------------------------------------------------------------------------------------------
// 終了
//-----------------------------------------------------------------------------------------------
void CExplosion::Uninit()
{
	CObject2D::Uninit();
}

//-----------------------------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------------------------
void CExplosion::Update()
{
	// カウントを増やす
	m_nCntAnim++;

	if (m_nCntAnim % ANIM_INTERVAL == 0)
	{
		// 今のアニメーションを1つ進める
		m_nPatternAnim++;
	}

	if (m_nPatternAnim == MAX_ANIM)
	{// アニメーションが終わったら
		// 終了する
		Uninit();
		return;
	}

	if (m_nPatternAnim >= DIVISION_U && m_nPatterAnimV <= 0)
	{
		m_nPatterAnimV++;
	}

	//頂点座標の設定
	CObject2D::SetVertex();

	// テクスチャ更新
	CObject2D::SetAnimation(m_nPatternAnim, m_nPatterAnimV, DIVISION_U, DIVISION_V);
}

//-----------------------------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------------------------
void CExplosion::Draw()
{
	CObject2D::Draw();
}