//=============================================================================
//
//	メイン処理 [main.h]
//	Author : 
//
//=============================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//*****************************************************************************
//	ヘッダファイルのインクルード
//*****************************************************************************
#include <windows.h>
#include <tchar.h> // _T
#include "d3dx9.h"						// 描画処理に必要
#define DIRECTINPUT_VERSION (0x0800)
#include "dinput.h"						// 入力処理に必要
#include "xaudio2.h"					// サウンド再生に必要
#include "Xinput.h"

//*****************************************************************************
//	ライブラリファイルのリンク
//*****************************************************************************
#pragma comment(lib,"d3d9.lib")   // 描画処理に必要
#pragma comment(lib,"d3dx9.lib")  // 拡張ライブラリ
#pragma comment(lib,"dxguid.lib") // コンポーネント使用に必要
#pragma comment(lib,"dinput8.lib") // 入力処理に必要
#pragma comment(lib,"winmm.lib")
#pragma comment (lib,"xinput.lib")

//*****************************************************************************
//	定数定義
//*****************************************************************************
// スクリーンの幅
const int SCREEN_WIDTH = 1280;
// スクリーンの高さ
const int SCREEN_HEIGHT = 720;

//*****************************************************************************
//	プロトタイプ宣言
//*****************************************************************************
int GetCounterFPS(void);

#endif
